Config/Documents/КорректировкаДолгосрочныхДоговоровОбразование.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>КорректировкаДолгосрочныхДоговоровОбразование</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ИсполнениеДоговоровСПокупателями</xr:Item>
				<xr:Item>AccumulationRegister.ОплатаОтПокупателейДебиторов</xr:Item>
				<xr:Item>InformationRegister.ПорядокОплатыОбразование</xr:Item>
				<xr:Item>InformationRegister.ПлановыеДатыОплатыОбразование</xr:Item>
				<xr:Item>InformationRegister.ПараметрыСписанияДоходовБудущихПериодов</xr:Item>
				<xr:Item>AccountingRegister.ЖурналПроводокЕПСБУ</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиФинансовогоОбеспечения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИДИсточника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидМежотчетногоПериода</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыМежотчетногоПериода</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДопКлассификация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДополнительнаяБюджетнаяКлассификация</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодМероприятия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Мероприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодЦели</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦелевыхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИзменитьПорядокУчетаДоходов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентИндексации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаРаспределенная</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериодаОбучения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериодаОбучения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДоходыБудущихПериодов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Comment>Для связи с табличной частью ОсобыйПорядокОплаты</Comment>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Студент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Студенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетДБП</Name>
							<Type>
								<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КФО</Name>
							<Type>
								<v8:Type>cfg:EnumRef.КВД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КПС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификационныеПризнакиСчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КЭК</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КОСГУ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОстатокДБП</Name>
							<Comment>Отложенные доходы</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Всего</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетРасчетов</Name>
							<Type>
								<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДопСубконтоРасчетов</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОсобыйПорядокОплаты</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОстатокДБПВВалюте</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПорядокОплаты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Comment>Для связи с табличной частью Начисления</Comment>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОплатитьДо</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачалоПериода</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонецПериода</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВВалюте</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВВалютеДоИзменений</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВВалютеПослеИзменений</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПорядокУчетаДоходов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОстатокДБП</Name>
							<Comment>Отложенные доходы</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособПризнанияДоходов</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СпособыПризнанияРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачалаСписания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончанияСписания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетДоходов</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.ЕПСБУ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоДоходов1</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоДоходов2</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоДоходов3</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДеятельностиНУ</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыДеятельностиДляНалоговогоУчетаЗатрат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетДоходовНУ</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.ЕПСБУ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяПрочихДоходовНУ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПрочиеДоходыИРасходы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Config/Enums/ВидыОперацийНачисленияДБП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыОперацийНачисленияДБП</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПередачаВАренду</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаВАрендуНаЛьготныхУсловиях</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаВБезвозмездноеПользование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДолгосрочныйДоговорОбразование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеДоходыБудущихПериодов</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Enums/ПорядокИсправленияОшибокПрошлыхЛет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ПорядокИсправленияОшибокПрошлыхЛет</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеОшибка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаПрошлогоГода</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаРанееПрошлогоГода</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Documents/КорректировкаДолгосрочныхДоговоровОбразование/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// Создает элементы справочника ДокументыБИА для выгрузки информации в 1С:Архив.
// 
// Параметры:
//  СсылкаНаОбъектИсточник - ОпределяемыйТип.СсылкаНаОбъектИсточникБИА - ссылка на объект,
//   который нужно передать в 1С:Архив.
//
// Возвращаемое значение:
//  Массив из ДокументОбъект.ДокументыБИА - созданные документы.
//
Функция СоздатьДокументыБИА(СсылкаНаОбъектИсточник) Экспорт
	СформированныеДокументыБИА = Новый Массив;
	
	ОбменСАрхивомБГУ.СоздатьДокументыБИАДляДокументаУчета(СсылкаНаОбъектИсточник, СформированныеДокументыБИА);
	
	Возврат СформированныеДокументыБИА;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПроведениеДокумента

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства) Экспорт
	
	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументСсылка,
		"Организация,Дата,ВидМежотчетногоПериода,Подразделение");
	
	ДатаУчетнойПолитики = ?(ЗначениеЗаполнено(ЗначенияРеквизитов.ВидМежотчетногоПериода),
		КонецГода(ЗначенияРеквизитов.Дата) + 1, ЗначенияРеквизитов.Дата);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.УстановитьПараметр("ОтражатьВНалоговомУчете",
		НалоговыйУчет.ПлательщикНалогаНаПрибыль(ЗначенияРеквизитов.Организация, ДатаУчетнойПолитики));
	Запрос.УстановитьПараметр("СчетаПрочихДоходов", БухгалтерскийУчет.СписокСчетов("Н91.01"));
	Запрос.УстановитьПараметр("ВалютаРегламентированногоУчета", Константы.ВалютаРегламентированногоУчета.Получить());
	
	НомераТаблиц = Новый Структура;
	
	НомераТаблиц.Вставить("ПараметрыСписанияДоходовБудущихПериодов", НомераТаблиц.Количество());
	Запрос.Текст =
	"ВЫБРАТЬ
	|	&Ссылка КАК Регистратор,
	|	ПорядокУчетаДоходов.Ссылка.Дата КАК Период,
	|	ПорядокУчетаДоходов.Договор КАК Договор,
	|	ПорядокУчетаДоходов.Ссылка.Организация КАК Организация,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыОперацийНачисленияДБП.ДолгосрочныйДоговорОбразование) КАК ВидОперации,
	|	ПорядокУчетаДоходов.СпособПризнанияДоходов КАК СпособПризнанияДоходов,
	|	ПорядокУчетаДоходов.ДатаНачалаСписания КАК ДатаНачалаСписания,
	|	ПорядокУчетаДоходов.ДатаОкончанияСписания КАК ДатаОкончанияСписания,
	|	ПорядокУчетаДоходов.СчетДоходов КАК СчетДоходов,
	|	ПорядокУчетаДоходов.СубконтоДоходов1 КАК СубконтоДоходов1,
	|	ПорядокУчетаДоходов.СубконтоДоходов2 КАК СубконтоДоходов2,
	|	ПорядокУчетаДоходов.СубконтоДоходов3 КАК СубконтоДоходов3,
	|	ВЫБОР
	|		КОГДА &ОтражатьВНалоговомУчете
	|			ТОГДА ПорядокУчетаДоходов.ВидДеятельностиНУ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляНалоговогоУчетаЗатрат.ПустаяСсылка)
	|	КОНЕЦ КАК ВидДеятельностиНУ,
	|	ВЫБОР
	|		КОГДА &ОтражатьВНалоговомУчете
	|			ТОГДА ПорядокУчетаДоходов.СчетДоходовНУ
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.ЕПСБУ.ПустаяСсылка)
	|	КОНЕЦ КАК СчетДоходовНУ,
	|	ВЫБОР
	|		КОГДА &ОтражатьВНалоговомУчете
	|				И ПорядокУчетаДоходов.СчетДоходовНУ В (&СчетаПрочихДоходов)
	|			ТОГДА ПорядокУчетаДоходов.СтатьяПрочихДоходовНУ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПрочиеДоходыИРасходы.ПустаяСсылка)
	|	КОНЕЦ КАК СтатьяПрочихДоходовНУ
	|ИЗ
	|	Документ.КорректировкаДолгосрочныхДоговоровОбразование.ПорядокУчетаДоходов КАК ПорядокУчетаДоходов
	|ГДЕ
	|	ПорядокУчетаДоходов.Ссылка = &Ссылка
	|	И ПорядокУчетаДоходов.Ссылка.ИзменитьПорядокУчетаДоходов = ИСТИНА";
	
	НомераТаблиц.Вставить("Начисления", НомераТаблиц.Количество());
	Запрос.Текст = Запрос.Текст + ОбщегоНазначения.РазделительПакетаЗапросов() +
	"ВЫБРАТЬ
	|	Начисления.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыРасчетовПоЗаймам.ОсновнойДолг) КАК ВидРасчетов,
	|	Начисления.Ссылка.ИФО КАК ИФО,
	|	Начисления.КФО КАК КФО,
	|	Начисления.КПС КАК КПС,
	|	Начисления.КЭК КАК КЭК,
	|	Начисления.Ссылка.ДопКлассификация КАК ДопКлассификация,
	|	Начисления.Ссылка.КодМероприятия КАК КодМероприятия,
	|	Начисления.Ссылка.КодЦели КАК КодЦели,
	|	Начисления.Ссылка.Организация КАК Организация,
	|	Начисления.Ссылка.Подразделение КАК Факультет,
	|	Начисления.Студент КАК Студент,
	|	Начисления.Контрагент КАК Контрагент,
	|	Начисления.Договор КАК Договор,
	|	Начисления.СчетРасчетов КАК СчетРасчетов,
	|	&ВалютаРегламентированногоУчета КАК Валюта,
	|	Начисления.Всего КАК СуммаВВалюте,
	|	Начисления.ОсобыйПорядокОплаты КАК ОсобыйПорядокОплаты
	|ИЗ
	|	Документ.КорректировкаДолгосрочныхДоговоровОбразование.ДоходыБудущихПериодов КАК Начисления
	|ГДЕ
	|	Начисления.Ссылка = &Ссылка";
	
	НомераТаблиц.Вставить("ПорядокОплаты", НомераТаблиц.Количество());
	Запрос.Текст = Запрос.Текст + ОбщегоНазначения.РазделительПакетаЗапросов() +
	"ВЫБРАТЬ
	|	ПорядокОплаты.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ПорядокОплаты.ОплатитьДо КАК ОплатитьДо,
	|	ПорядокОплаты.КонецПериода КАК ИсполнитьДо,
	|	ПорядокОплаты.НачалоПериода КАК НачалоПериода,
	|	ПорядокОплаты.КонецПериода КАК КонецПериода,
	|	ПорядокОплаты.Примечание КАК Примечание,
	|	ПорядокОплаты.Валюта КАК Валюта,
	|	ПорядокОплаты.СуммаВВалютеДоИзменений КАК СуммаВВалютеДоИзменений,
	|	ПорядокОплаты.СуммаВВалюте КАК СуммаВВалюте,
	|	ПорядокОплаты.СуммаВВалютеПослеИзменений КАК СуммаВВалютеПослеИзменений
	|ИЗ
	|	Документ.КорректировкаДолгосрочныхДоговоровОбразование.ПорядокОплаты КАК ПорядокОплаты
	|ГДЕ
	|	ПорядокОплаты.Ссылка = &Ссылка";
	
	Результат = Запрос.ВыполнитьПакет();
	
	ТаблицыДляДвижений = ДополнительныеСвойства.ТаблицыДляДвижений;
	ОбщегоНазначенияБГУ.ВыгрузитьТаблицыЗапроса(ТаблицыДляДвижений, Результат, НомераТаблиц);
	
	Начисления = Результат[НомераТаблиц.Начисления].Выгрузить();
	ПорядокОплаты = Результат[НомераТаблиц.ПорядокОплаты].Выгрузить();
	
	ИспользоватьКонтрольИсполненияДоговоров = ПолучитьФункциональнуюОпцию("ИспользоватьКонтрольИсполненияДоговоров");
	Если ИспользоватьКонтрольИсполненияДоговоров Тогда
		ОплатаОтПокупателейДебиторов = РегистрыНакопления.ОплатаОтПокупателейДебиторов.СоздатьНаборЗаписей().ВыгрузитьКолонки();
		ИсполнениеДоговоровСПокупателями = РегистрыНакопления.ИсполнениеДоговоровСПокупателями.СоздатьНаборЗаписей().ВыгрузитьКолонки();
	КонецЕсли;
	ПорядокОплатыОбразование = РегистрыСведений.ПорядокОплатыОбразование.СоздатьНаборЗаписей().ВыгрузитьКолонки();
	ПлановыеДатыОплатыОбразование = РегистрыСведений.ПлановыеДатыОплатыОбразование.СоздатьНаборЗаписей().ВыгрузитьКолонки();
	
	Для Каждого СтрокаТаблицы Из Начисления Цикл
		
		Если СтрокаТаблицы.ОсобыйПорядокОплаты Тогда
			// Отберем строки с идентификатором начисления.
			ОтборСтрок = Новый Структура("ИдентификаторСтроки", СтрокаТаблицы.ИдентификаторСтроки);
		Иначе // Отберем строки с пустым идентификатором.
			ОтборСтрок = Новый Структура("ИдентификаторСтроки",
				Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
		КонецЕсли;
		
		// Порядок оплаты для данной строки начисления студенту.
		ГрафикПоДоговору = ПорядокОплаты.Скопировать(ОтборСтрок,
			"ОплатитьДо,ИсполнитьДо,НачалоПериода,КонецПериода,Примечание,
			|СуммаВВалютеДоИзменений,СуммаВВалюте,СуммаВВалютеПослеИзменений,Валюта");
		
		Для Каждого СтрокаГрафика Из ГрафикПоДоговору Цикл
			
			Если ИспользоватьКонтрольИсполненияДоговоров
				И СтрокаГрафика.СуммаВВалюте <> 0 Тогда
				
				// График платежей.
				НоваяЗапись = ОплатаОтПокупателейДебиторов.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяЗапись, СтрокаТаблицы);
				НоваяЗапись.Период     = СтрокаГрафика.ОплатитьДо;
				НоваяЗапись.ОплатитьДо = СтрокаГрафика.ОплатитьДо;
				НоваяЗапись.Сумма      = СтрокаГрафика.СуммаВВалюте;
				
				// План-график реализации.
				НоваяЗапись = ИсполнениеДоговоровСПокупателями.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяЗапись, СтрокаТаблицы);
				НоваяЗапись.Период      = СтрокаГрафика.ИсполнитьДо;
				НоваяЗапись.ИсполнитьДо = СтрокаГрафика.ИсполнитьДо;
				НоваяЗапись.Сумма       = СтрокаГрафика.СуммаВВалюте;
				
			КонецЕсли;
			
			Если СтрокаГрафика.СуммаВВалютеПослеИзменений <> 0 Тогда
				
				// Порядок оплаты.
				НоваяЗапись = ПорядокОплатыОбразование.Добавить();
				НоваяЗапись.Организация = ЗначенияРеквизитов.Организация;
				НоваяЗапись.Факультет   = ЗначенияРеквизитов.Подразделение;
				НоваяЗапись.Учащийся    = СтрокаТаблицы.Студент;
				ЗаполнитьЗначенияСвойств(НоваяЗапись, СтрокаТаблицы, "Контрагент,Договор");
				ЗаполнитьЗначенияСвойств(НоваяЗапись, СтрокаГрафика, "ОплатитьДо,НачалоПериода,КонецПериода,Примечание,Валюта");
				НоваяЗапись.СуммаВВалюте = СтрокаГрафика.СуммаВВалютеПослеИзменений;
				
			КонецЕсли;
			
		КонецЦикла;
		
		// При формировании движений по регистру ПлановыеДатыОплатыОбразование сворачиваем порядок оплаты по колонке "Оплатить до",
		// чтобы избежать дублирования записей по значениям измерений.
		ПлановыеДатыОплаты = ГрафикПоДоговору.Скопировать(, "ОплатитьДо,СуммаВВалютеПослеИзменений");
		ПлановыеДатыОплаты.Свернуть("ОплатитьДо", "СуммаВВалютеПослеИзменений");
		ПлановыеДатыОплаты.Сортировать("ОплатитьДо");
		Для Каждого ПлановаяДатаОплаты Из ПлановыеДатыОплаты Цикл
			
			ОтборПоДатеОплаты = Новый Структура("ОплатитьДо", ПлановаяДатаОплаты.ОплатитьДо);
			НайденныеСтроки = ГрафикПоДоговору.НайтиСтроки(ОтборПоДатеОплаты);
			
			Если НайденныеСтроки.Количество() > 1 Тогда
				
				ИтогСуммаВВалюте = 0;
				МинНачалоПериода = '00010101';
				МаксКонецПериода = '00010101';
				Для Каждого СтрокаГрафика Из НайденныеСтроки Цикл
					ИтогСуммаВВалюте = ИтогСуммаВВалюте + СтрокаГрафика.СуммаВВалютеПослеИзменений;
					МинНачалоПериода = ?(НЕ ЗначениеЗаполнено(МинНачалоПериода), СтрокаГрафика.НачалоПериода,
						Мин(МинНачалоПериода, СтрокаГрафика.НачалоПериода) );
					МаксКонецПериода = ?(НЕ ЗначениеЗаполнено(МаксКонецПериода), СтрокаГрафика.КонецПериода,
						Макс(МаксКонецПериода, СтрокаГрафика.КонецПериода) );
				КонецЦикла;
				
				НоваяЗапись = ПлановыеДатыОплатыОбразование.Добавить();
				НоваяЗапись.Учащийся      = СтрокаТаблицы.Студент;
				НоваяЗапись.Договор       = СтрокаТаблицы.Договор;
				НоваяЗапись.Факультет     = ЗначенияРеквизитов.Подразделение;
				НоваяЗапись.Валюта        = СтрокаТаблицы.Валюта;
				НоваяЗапись.ДатаОплаты    = ПлановаяДатаОплаты.ОплатитьДо;
				НоваяЗапись.Сумма         = ИтогСуммаВВалюте;
				НоваяЗапись.АвтоРасчет    = Ложь;
				НоваяЗапись.НачалоПериода = МинНачалоПериода;
				НоваяЗапись.КонецПериода  = МаксКонецПериода;
				
			ИначеЕсли НайденныеСтроки.Количество() = 1 Тогда
				
				СтрокаГрафика = НайденныеСтроки[0];
				
				НоваяЗапись = ПлановыеДатыОплатыОбразование.Добавить();
				НоваяЗапись.Учащийся      = СтрокаТаблицы.Студент;
				НоваяЗапись.Договор       = СтрокаТаблицы.Договор;
				НоваяЗапись.Факультет     = ЗначенияРеквизитов.Подразделение;
				НоваяЗапись.Валюта        = СтрокаТаблицы.Валюта;
				НоваяЗапись.ДатаОплаты    = СтрокаГрафика.ОплатитьДо;
				НоваяЗапись.Сумма         = СтрокаГрафика.СуммаВВалютеПослеИзменений;
				НоваяЗапись.АвтоРасчет    = Ложь;
				НоваяЗапись.НачалоПериода = СтрокаГрафика.НачалоПериода;
				НоваяЗапись.КонецПериода  = СтрокаГрафика.КонецПериода;
				НоваяЗапись.Примечание    = СтрокаГрафика.Примечание;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Если ИспользоватьКонтрольИсполненияДоговоров Тогда
		
		ОплатаОтПокупателейДебиторов.ЗаполнитьЗначения(ВидДвиженияНакопления.Приход, "ВидДвижения");
		ОплатаОтПокупателейДебиторов.ЗаполнитьЗначения(Истина, "Активность");
		ОплатаОтПокупателейДебиторов.ЗаполнитьЗначения(ДокументСсылка, "Регистратор");
		ТаблицыДляДвижений.Вставить("ОплатаОтПокупателейДебиторов", ОплатаОтПокупателейДебиторов);
		
		ИсполнениеДоговоровСПокупателями.ЗаполнитьЗначения(ВидДвиженияНакопления.Приход, "ВидДвижения");
		ИсполнениеДоговоровСПокупателями.ЗаполнитьЗначения(Истина, "Активность");
		ИсполнениеДоговоровСПокупателями.ЗаполнитьЗначения(ДокументСсылка, "Регистратор");
		ТаблицыДляДвижений.Вставить("ИсполнениеДоговоровСПокупателями", ИсполнениеДоговоровСПокупателями);
		
		Если ТипЗнч(ДополнительныеСвойства.ДанныеАвтоПроведения) = Тип("Структура")
			И ТипЗнч(ДополнительныеСвойства.ДанныеАвтоПроведения.ДополнительныеРеквизиты) = Тип("Структура")
			И ДополнительныеСвойства.ДанныеАвтоПроведения.ДополнительныеРеквизиты.Свойство("ИсправлениеОшибки")
			И ДополнительныеСвойства.ДанныеАвтоПроведения.ДополнительныеРеквизиты.ИсправлениеОшибки <> Перечисления.ПорядокИсправленияОшибокПрошлыхЛет.НеОшибка Тогда
			// Это исправление ошибок прошлых лет.
			КонтрольИсполненияДоговоров.УстановитьПризнакИсправлениеОшибокПрошлыхЛетВДвиженияхПоРегистру(ТаблицыДляДвижений, "ОплатаОтПокупателейДебиторов");
			КонтрольИсполненияДоговоров.УстановитьПризнакИсправлениеОшибокПрошлыхЛетВДвиженияхПоРегистру(ТаблицыДляДвижений, "ИсполнениеДоговоровСПокупателями");
		КонецЕсли;
		
	КонецЕсли;
	
	ПорядокОплатыОбразование.ЗаполнитьЗначения(Истина, "Активность");
	ПорядокОплатыОбразование.ЗаполнитьЗначения(ДокументСсылка, "Регистратор");
	ПорядокОплатыОбразование.ЗаполнитьЗначения(ЗначенияРеквизитов.Дата, "Период");
	ТаблицыДляДвижений.Вставить("ПорядокОплатыОбразование", ПорядокОплатыОбразование);
	
	ПлановыеДатыОплатыОбразование.ЗаполнитьЗначения(Истина, "Активность");
	ПлановыеДатыОплатыОбразование.ЗаполнитьЗначения(ДокументСсылка, "Регистратор");
	ПлановыеДатыОплатыОбразование.ЗаполнитьЗначения(ЗначенияРеквизитов.Дата, "Период");
	ТаблицыДляДвижений.Вставить("ПлановыеДатыОплатыОбразование", ПлановыеДатыОплатыОбразование);
	
	// Удалим временные таблицы.
	ТаблицыДляДвижений.Удалить("Начисления");
	ТаблицыДляДвижений.Удалить("ПорядокОплаты");
	
КонецПроцедуры

#КонецОбласти

#Область ПечатьДокумента

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
КонецПроцедуры

#КонецОбласти

#Область ЗаполнениеДокумента

Процедура ЗаполнитьПоОстаткам(ДокументОбъект, ДанныеУчащихся,
			ЗаполнитьСуммыДоходов = Истина, ЗаполнитьПорядокУчетаДоходов = Истина) Экспорт
	
	Если ДанныеУчащихся.Количество() = 0 Тогда
		Возврат; // Нет списка учащихся для расчета сумм начислений.
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация",    ДокументОбъект.Организация);
	Запрос.УстановитьПараметр("Факультет",      ДокументОбъект.Подразделение);
	Запрос.УстановитьПараметр("Номенклатура",   ДокументОбъект.Номенклатура);
	Запрос.УстановитьПараметр("КонецПериода",   КонецДня(ДокументОбъект.Дата));
	Запрос.УстановитьПараметр("ДанныеУчащихся", ДанныеУчащихся);
	Запрос.УстановитьПараметр("СчетаДБП",       БухгалтерскийУчет.СписокСчетов("401.40"));
	
	ВидыСубконто = Новый Массив();
	ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.Номенклатура);
	ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.Договоры);
	Запрос.УстановитьПараметр("ВидыСубконтоДБП", ВидыСубконто);
	
	ИспользоватьВалютныйУчет = ПолучитьФункциональнуюОпцию("ИспользоватьВалютныйУчет");
	НастройкиСчетовУчетаДБП = УчетДоходовРасходов.НастройкиСчетовУчетаДБП();
	ВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();
	Запрос.УстановитьПараметр("ВалютаРеглУчета", ВалютаРегламентированногоУчета);
	
	НомераТаблиц = Новый Структура;
	
	НомераТаблиц.Вставить("ДанныеУчащихся", НомераТаблиц.Количество());
	НомераТаблиц.Вставить("СписокУчащихся", НомераТаблиц.Количество());
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДанныеУчащихся.Студент КАК Студент,
	|	ДанныеУчащихся.Контрагент КАК Контрагент,
	|	ДанныеУчащихся.ДоговорКонтрагента КАК Договор
	|ПОМЕСТИТЬ ДанныеУчащихся
	|ИЗ
	|	&ДанныеУчащихся КАК ДанныеУчащихся
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СписокУчащихся.Студент КАК Студент,
	|	СписокУчащихся.Контрагент КАК Контрагент,
	|	СписокУчащихся.Договор КАК Договор
	|ИЗ
	|	ДанныеУчащихся КАК СписокУчащихся";
	
	НомераТаблиц.Вставить("ПараметрыСписанияДоходовБудущихПериодов", НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ОстаткиДБП", НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ДоходыБудущихПериодов", НомераТаблиц.Количество());
	Запрос.Текст = Запрос.Текст + ?(ЗначениеЗаполнено(Запрос.Текст), ОбщегоНазначения.РазделительПакетаЗапросов(), "") +
	"ВЫБРАТЬ
	|	ПараметрыСписанияДоходовБудущихПериодов.Организация КАК Организация,
	|	ПараметрыСписанияДоходовБудущихПериодов.Договор КАК Договор,
	|	ПараметрыСписанияДоходовБудущихПериодов.Договор.Контрагент КАК Контрагент,
	|	ПараметрыСписанияДоходовБудущихПериодов.ВидОперации КАК ВидОперации,
	|	ПараметрыСписанияДоходовБудущихПериодов.СпособПризнанияДоходов КАК СпособПризнанияДоходов,
	|	ПараметрыСписанияДоходовБудущихПериодов.ДатаНачалаСписания КАК ДатаНачалаСписания,
	|	ПараметрыСписанияДоходовБудущихПериодов.ДатаОкончанияСписания КАК ДатаОкончанияСписания,
	|	ПараметрыСписанияДоходовБудущихПериодов.СчетДоходов КАК СчетДоходов,
	|	ПараметрыСписанияДоходовБудущихПериодов.СубконтоДоходов1 КАК СубконтоДоходов1,
	|	ПараметрыСписанияДоходовБудущихПериодов.СубконтоДоходов2 КАК СубконтоДоходов2,
	|	ПараметрыСписанияДоходовБудущихПериодов.СубконтоДоходов3 КАК СубконтоДоходов3,
	|	ПараметрыСписанияДоходовБудущихПериодов.ВидДеятельностиНУ КАК ВидДеятельностиНУ,
	|	ПараметрыСписанияДоходовБудущихПериодов.СчетДоходовНУ КАК СчетДоходовНУ,
	|	ПараметрыСписанияДоходовБудущихПериодов.СтатьяПрочихДоходовНУ КАК СтатьяПрочихДоходовНУ
	|ПОМЕСТИТЬ ПараметрыСписанияДоходовБудущихПериодов
	|ИЗ
	|	РегистрСведений.ПараметрыСписанияДоходовБудущихПериодов.СрезПоследних(
	|			&КонецПериода,
	|			Организация = &Организация
	|				И Договор В
	|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|						ДанныеУчащихся.Договор
	|					ИЗ
	|						ДанныеУчащихся)) КАК ПараметрыСписанияДоходовБудущихПериодов
	|ГДЕ
	|	ПараметрыСписанияДоходовБудущихПериодов.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийНачисленияДБП.ДолгосрочныйДоговорОбразование)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Договор,
	|	Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиДБП.Организация КАК Организация,
	|	ЕСТЬNULL(ОстаткиДБП.ИФО, ЗНАЧЕНИЕ(Справочник.ИсточникиФинансовогоОбеспечения.ПустаяСсылка)) КАК ИФО,
	|	ОстаткиДБП.КФО КАК КФО,
	|	ОстаткиДБП.КПС КАК КПС,
	|	ОстаткиДБП.КЭК КАК КЭК,
	|	ОстаткиДБП.Счет КАК СчетДБП,
	|	ОстаткиДБП.Подразделение КАК Подразделение,
	|	ВЫРАЗИТЬ(ОстаткиДБП.Субконто1 КАК Справочник.Номенклатура) КАК Номенклатура,
	|	ВЫРАЗИТЬ(ОстаткиДБП.Субконто1 КАК Справочник.Номенклатура).Наименование КАК НоменклатураПредставление,
	|	ВЫРАЗИТЬ(ОстаткиДБП.Субконто1 КАК Справочник.Номенклатура).СтавкаНДС КАК СтавкаНДС,
	|	ВЫРАЗИТЬ(ОстаткиДБП.Субконто2 КАК Справочник.Договоры) КАК Договор,
	|	ВЫРАЗИТЬ(ОстаткиДБП.Субконто2 КАК Справочник.Договоры).Наименование КАК ДоговорПредставление,
	|	ЕСТЬNULL(ОстаткиДБП.Валюта, &ВалютаРеглУчета) КАК Валюта,
	|	ОстаткиДБП.СуммаОстатокКт КАК ОстатокДБП,
	|	ОстаткиДБП.ВалютнаяСуммаОстатокКт КАК ОстатокДБПВВалюте
	|ПОМЕСТИТЬ ОстаткиДБП
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Остатки(
	|			&КонецПериода,
	|			Счет В (&СчетаДБП),
	|			&ВидыСубконтоДБП,
	|			Организация = &Организация
	|				И &УсловиеИФО
	|				И Субконто1 = &Номенклатура
	|				И Субконто2 В
	|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|						ДанныеУчащихся.Договор
	|					ИЗ
	|						ДанныеУчащихся)) КАК ОстаткиДБП
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Договор,
	|	Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиДБП.Организация КАК Организация,
	|	ОстаткиДБП.ИФО КАК ИФО,
	|	ОстаткиДБП.КФО КАК КФО,
	|	ОстаткиДБП.КПС КАК КПС,
	|	ОстаткиДБП.КЭК КАК КЭК,
	|	ОстаткиДБП.СчетДБП КАК СчетДБП,
	|	ОстаткиДБП.Подразделение КАК Подразделение,
	|	ОстаткиДБП.Номенклатура КАК Номенклатура,
	|	ОстаткиДБП.НоменклатураПредставление КАК НоменклатураПредставление,
	|	ОстаткиДБП.СтавкаНДС КАК СтавкаНДС,
	|	ОстаткиДБП.Договор КАК Договор,
	|	ОстаткиДБП.ДоговорПредставление КАК ДоговорПредставление,
	|	ОстаткиДБП.Валюта КАК Валюта,
	|	ОстаткиДБП.ОстатокДБП КАК ОстатокДБП,
	|	ОстаткиДБП.ОстатокДБПВВалюте КАК ОстатокДБПВВалюте,
	|	ПараметрыСписанияДоходовБудущихПериодов.Контрагент КАК Контрагент,
	|	ПараметрыСписанияДоходовБудущихПериодов.СпособПризнанияДоходов КАК СпособПризнанияДоходов,
	|	ПараметрыСписанияДоходовБудущихПериодов.ДатаНачалаСписания КАК ДатаНачалаСписания,
	|	ПараметрыСписанияДоходовБудущихПериодов.ДатаОкончанияСписания КАК ДатаОкончанияСписания,
	|	ПараметрыСписанияДоходовБудущихПериодов.СчетДоходов КАК СчетДоходов,
	|	ПараметрыСписанияДоходовБудущихПериодов.СубконтоДоходов1 КАК СубконтоДоходов1,
	|	ПараметрыСписанияДоходовБудущихПериодов.СубконтоДоходов2 КАК СубконтоДоходов2,
	|	ПараметрыСписанияДоходовБудущихПериодов.СубконтоДоходов3 КАК СубконтоДоходов3,
	|	ПараметрыСписанияДоходовБудущихПериодов.ВидДеятельностиНУ КАК ВидДеятельностиНУ,
	|	ПараметрыСписанияДоходовБудущихПериодов.СчетДоходовНУ КАК СчетДоходовНУ,
	|	ПараметрыСписанияДоходовБудущихПериодов.СтатьяПрочихДоходовНУ КАК СтатьяПрочихДоходовНУ
	|ИЗ
	|	ОстаткиДБП КАК ОстаткиДБП
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПараметрыСписанияДоходовБудущихПериодов КАК ПараметрыСписанияДоходовБудущихПериодов
	|		ПО ОстаткиДБП.Договор = ПараметрыСписанияДоходовБудущихПериодов.Договор
	|			И ОстаткиДБП.Организация = ПараметрыСписанияДоходовБудущихПериодов.Организация";
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоИФО") И ЗначениеЗаполнено(ДокументОбъект.ИФО) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеИФО", "ИФО = &ИФО");
		Запрос.УстановитьПараметр("ИФО", ДокументОбъект.ИФО);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеИФО", "ИСТИНА");
	КонецЕсли;
	
	Результат = Запрос.ВыполнитьПакет();
	
	СписокУчащихся     = Результат[НомераТаблиц.СписокУчащихся].Выгрузить();
	ТаблицаОстатковДБП = Результат[НомераТаблиц.ДоходыБудущихПериодов].Выгрузить();
	
	Если ЗаполнитьСуммыДоходов Тогда
		
		// Определим последние регистраторы движений регистра ПорядокОплатыОбразование.
		ЗапросРегистраторы = Новый Запрос;
		ЗапросРегистраторы.УстановитьПараметр("ДатаСреза",   КонецДня(ДокументОбъект.Дата));
		ЗапросРегистраторы.УстановитьПараметр("Организация", ДокументОбъект.Организация);
		ЗапросРегистраторы.УстановитьПараметр("Договоры",
			ОбщегоНазначенияБГУ.УдалитьПовторяющиесяЭлементыМассива(ТаблицаОстатковДБП.ВыгрузитьКолонку("Договор")));
		ЗапросРегистраторы.УстановитьПараметр("Учащиеся",
			ОбщегоНазначенияБГУ.УдалитьПовторяющиесяЭлементыМассива(ДанныеУчащихся.ВыгрузитьКолонку("Студент")));
		ЗапросРегистраторы.УстановитьПараметр("Контрагенты",
			ОбщегоНазначенияБГУ.УдалитьПовторяющиесяЭлементыМассива(ДанныеУчащихся.ВыгрузитьКолонку("Контрагент")));
		ЗапросРегистраторы.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПорядокОплатыОбразованиеСрезПоследних.Период КАК Период,
		|	ПорядокОплатыОбразованиеСрезПоследних.Регистратор КАК Регистратор,
		|	ПорядокОплатыОбразованиеСрезПоследних.Активность КАК Активность,
		|	ПорядокОплатыОбразованиеСрезПоследних.Организация КАК Организация,
		|	ПорядокОплатыОбразованиеСрезПоследних.Договор КАК Договор,
		|	ПорядокОплатыОбразованиеСрезПоследних.Учащийся КАК Учащийся,
		|	ПорядокОплатыОбразованиеСрезПоследних.Контрагент КАК Контрагент
		|ИЗ
		|	РегистрСведений.ПорядокОплатыОбразование.СрезПоследних(
		|			&ДатаСреза,
		|			Активность = ИСТИНА
		|				И Организация = &Организация
		|				И Договор В (&Договоры)
		|				И Учащийся В (&Учащиеся)
		|				И Контрагент В (&Контрагенты)) КАК ПорядокОплатыОбразованиеСрезПоследних
		|
		|УПОРЯДОЧИТЬ ПО
		|	Договор,
		|	Учащийся,
		|	Контрагент,
		|	Период УБЫВ";
		Регистраторы = ЗапросРегистраторы.Выполнить().Выгрузить();
		
		// Удалим повторы, которые могут появляться в СрезеПоследних.
		СтрокиКУдалению   = Новый Массив;
		ТекущийДоговор    = Неопределено;
		ТекущийУчащийся   = Неопределено;
		ТекущийКонтрагент = Неопределено;
		Для Каждого СтрокаРегистратор Из Регистраторы Цикл
			Если ТекущийДоговор = СтрокаРегистратор.Договор
				И ТекущийУчащийся = СтрокаРегистратор.Учащийся
				И ТекущийКонтрагент = СтрокаРегистратор.Контрагент Тогда
				// Для данной комбинации Договор / Учащийся / Контрагент есть регистратор с более поздней датой.
				СтрокиКУдалению.Добавить(СтрокаРегистратор);
			КонецЕсли;
			ТекущийДоговор    = СтрокаРегистратор.Договор;
			ТекущийУчащийся   = СтрокаРегистратор.Учащийся;
			ТекущийКонтрагент = СтрокаРегистратор.Контрагент;
		КонецЦикла;
		Для Каждого СтрокаКУдалению Из СтрокиКУдалению Цикл
			Регистраторы.Удалить(СтрокаКУдалению);
		КонецЦикла;
		
		// Определим порядок оплаты по интересующим договорам.
		ЗапросПорядокОплаты = Новый Запрос;
		ЗапросПорядокОплаты.УстановитьПараметр("ПериодДвижений", Регистраторы);
		ЗапросПорядокОплаты.Текст = 
		"ВЫБРАТЬ
		|	ПериодДвижений.Период КАК Период,
		|	ПериодДвижений.Регистратор КАК Регистратор,
		|	ПериодДвижений.Активность КАК Активность,
		|	ПериодДвижений.Организация КАК Организация,
		|	ПериодДвижений.Договор КАК Договор,
		|	ПериодДвижений.Учащийся КАК Учащийся,
		|	ПериодДвижений.Контрагент КАК Контрагент
		|ПОМЕСТИТЬ ПериодДвижений
		|ИЗ
		|	&ПериодДвижений КАК ПериодДвижений
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПорядокОплатыОбразование.Организация КАК Организация,
		|	ПорядокОплатыОбразование.Учащийся КАК Студент,
		|	ПорядокОплатыОбразование.Контрагент КАК Контрагент,
		|	ПорядокОплатыОбразование.Договор КАК Договор,
		|	ПорядокОплатыОбразование.Факультет КАК Факультет,
		|	ПорядокОплатыОбразование.ОплатитьДо КАК ОплатитьДо,
		|	ПорядокОплатыОбразование.Валюта КАК Валюта,
		|	ПРЕДСТАВЛЕНИЕ(ПорядокОплатыОбразование.Валюта) КАК ВалютаПредставление,
		|	ПорядокОплатыОбразование.СуммаВВалюте КАК СуммаВВалюте,
		|	ПорядокОплатыОбразование.НачалоПериода КАК НачалоПериода,
		|	ПорядокОплатыОбразование.КонецПериода КАК КонецПериода,
		|	ПорядокОплатыОбразование.Примечание КАК Примечание,
		|	ПорядокОплатыОбразование.Регистратор КАК Регистратор,
		|	ПорядокОплатыОбразование.Период КАК Период
		|ИЗ
		|	ПериодДвижений КАК ПериодДвижений
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПорядокОплатыОбразование КАК ПорядокОплатыОбразование
		|		ПО ПериодДвижений.Период = ПорядокОплатыОбразование.Период
		|			И ПериодДвижений.Регистратор = ПорядокОплатыОбразование.Регистратор
		|			И ПериодДвижений.Активность = ПорядокОплатыОбразование.Активность
		|			И ПериодДвижений.Организация = ПорядокОплатыОбразование.Организация
		|			И ПериодДвижений.Договор = ПорядокОплатыОбразование.Договор
		|			И ПериодДвижений.Учащийся = ПорядокОплатыОбразование.Учащийся
		|			И ПериодДвижений.Контрагент = ПорядокОплатыОбразование.Контрагент
		|ГДЕ
		|	ПорядокОплатыОбразование.СуммаВВалюте <> 0
		|
		|УПОРЯДОЧИТЬ ПО
		|	Студент,
		|	Контрагент,
		|	Договор,
		|	Валюта,
		|	ОплатитьДо,
		|	НачалоПериода,
		|	КонецПериода";
		ПорядокОплатыОбразование = ЗапросПорядокОплаты.Выполнить().Выгрузить();
		
		ДокументОбъект.ДоходыБудущихПериодов.Очистить();
		ДокументОбъект.ПорядокОплаты.Очистить();
		
		ДатаУчетнойПолитики = ?(ЗначениеЗаполнено(ДокументОбъект.ВидМежотчетногоПериода),
			КонецГода(ДокументОбъект.Дата) + 1, ДокументОбъект.Дата);
		
		ВедетсяУчетДБППоПодразделениям = ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоПодразделениям")
			И БухгалтерскийУчетПовтИсп.ПолучитьПризнакиУчета("401.40").УчетПоПодразделениям;
		
		// Расчет сумм доходов будущих периодов.
		Для Каждого ОстаткиДБП Из ТаблицаОстатковДБП Цикл
			
			НоваяСтрока = ДокументОбъект.ДоходыБудущихПериодов.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ОстаткиДБП);
			
			Отбор = Новый Структура("Договор", ОстаткиДБП.Договор);
			НайденныеСтроки = СписокУчащихся.НайтиСтроки(Отбор);
			Если НайденныеСтроки.Количество() = 1 Тогда // 1 плательщик, 1 студент.
				НоваяСтрока.Студент = НайденныеСтроки[0].Студент;
				НоваяСтрока.Контрагент = НайденныеСтроки[0].Контрагент;
				
			ИначеЕсли НайденныеСтроки.Количество() > 1 Тогда
				
				ОтборПоПлательщику = Новый Структура("Договор, Контрагент", ОстаткиДБП.Договор, НайденныеСтроки[0].Контрагент);
				НайденныеСтуденты = СписокУчащихся.НайтиСтроки(ОтборПоПлательщику);
				ОтборПоСтуденту = Новый Структура("Договор, Студент", ОстаткиДБП.Договор, НайденныеСтроки[0].Студент);
				НайденныеПлательщики = СписокУчащихся.НайтиСтроки(ОтборПоСтуденту);
				
				Если НайденныеПлательщики.Количество() > 1 Тогда
				
					ТекстПлательщики = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='%1; и еще %2 ...'"),
						НайденныеПлательщики[0].Контрагент,
						НайденныеПлательщики.Количество() - 1);
					ТекстОшибки = НСтр("ru='По договору ""%1"" зарегистрировано несколько плательщиков: %2
						|Для корректировки таких договоров рекомендуется использовать документы ""%3"", которые необходимо вводить отдельно по каждому плательщику.'");
					ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки,
						ОстаткиДБП.Договор,
						ТекстПлательщики,
						Метаданные.Документы.КорректировкаДоходовБудущихПериодовОбразование.Синоним);
					ПолеДоговор = "ДоходыБудущихПериодов[" + Формат(НоваяСтрока.НомерСтроки - 1, "ЧН=0; ЧГ=") + "].Договор";
					ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, ДокументОбъект.Ссылка, ПолеДоговор, "Объект");
					
				ИначеЕсли НайденныеСтуденты.Количество() > 1 Тогда
				
					ТекстСтуденты = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='%1; и еще %2 ...'"),
						НайденныеСтуденты[0].Студент,
						НайденныеСтуденты.Количество() - 1);
					ТекстОшибки = НСтр("ru='По договору ""%1"" обучается несколько учащихся: %2
						|Для корректировки таких договоров рекомендуется использовать документы ""%3"", которые необходимо вводить отдельно по каждому учащемуся.'");
					ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки,
						ОстаткиДБП.Договор,
						ТекстСтуденты,
						Метаданные.Документы.КорректировкаДоходовБудущихПериодовОбразование.Синоним);
					ПолеДоговор = "ДоходыБудущихПериодов[" + Формат(НоваяСтрока.НомерСтроки - 1, "ЧН=0; ЧГ=") + "].Договор";
					ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, ДокументОбъект.Ссылка, ПолеДоговор, "Объект");
					
				КонецЕсли;
				
			КонецЕсли;
			
			НоваяСтрока.СчетРасчетов = БухгалтерскийУчет.ПолучитьАналитическийСчетПоКЭК(
				НоваяСтрока.КЭК, "205.00",, ДатаУчетнойПолитики, ДокументОбъект.Организация, ДокументОбъект.ИФО);
			
		КонецЦикла;
		ДокументОбъект.ДоходыБудущихПериодов.Сортировать("Студент,Контрагент,Договор");
		
		// Определим порядок оплаты, который будет использоваться в качестве общего (стандартного).
		СлужебнаяПорядокОплаты = ПорядокОплатыОбразование.СкопироватьКолонки("Студент,Контрагент,Договор");
		СлужебнаяПорядокОплаты.Колонки.Добавить("Хеш", Новый ОписаниеТипов("Строка"));
		СлужебнаяПорядокОплаты.Колонки.Добавить("КоличествоВхождений", Новый ОписаниеТипов("Число"));
		ПорядокОплатыСтудент    = Справочники.Студенты.ПустаяСсылка();
		ПорядокОплатыКонтрагент = Справочники.Контрагенты.ПустаяСсылка();
		ПорядокОплатыДоговор    = Справочники.Договоры.ПустаяСсылка();
		Для Каждого СтрокаПорядокОплаты Из ПорядокОплатыОбразование Цикл
			
			НовыйПорядокОплаты = Ложь;
			Если  Не ЗначениеЗаполнено(ПорядокОплатыСтудент)
				И Не ЗначениеЗаполнено(ПорядокОплатыКонтрагент)
				И Не ЗначениеЗаполнено(ПорядокОплатыДоговор) Тогда
				НовыйПорядокОплаты = Истина; // Первая строка.
			ИначеЕсли СтрокаПорядокОплаты.Студент  <> ПорядокОплатыСтудент
				ИЛИ СтрокаПорядокОплаты.Контрагент <> ПорядокОплатыКонтрагент
				ИЛИ СтрокаПорядокОплаты.Договор    <> ПорядокОплатыДоговор Тогда
				НовыйПорядокОплаты = Истина;
			КонецЕсли;
			
			Если НовыйПорядокОплаты Тогда
				НоваяСтрока = СлужебнаяПорядокОплаты.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаПорядокОплаты, "Студент,Контрагент,Договор");
				НоваяСтрока.КоличествоВхождений = 1;
			КонецЕсли;
			
			// Для расчета количества вхождений представим массив входных данных (порядок оплаты) в виде хеш-функции.
			НоваяСтрока.Хеш = НоваяСтрока.Хеш
				+ СтрокаПорядокОплаты.ВалютаПредставление  + "#"
				+ Строка(СтрокаПорядокОплаты.СуммаВВалюте) + "#"
				+ Формат(СтрокаПорядокОплаты.ОплатитьДо,    "ДЛФ=Д") + "#"
				+ Формат(СтрокаПорядокОплаты.НачалоПериода, "ДЛФ=Д") + "#"
				+ Формат(СтрокаПорядокОплаты.КонецПериода,  "ДЛФ=Д") + "#"
				+ Строка(СтрокаПорядокОплаты.Примечание) + "|";
			
			// Запомним текущие значения ключей поиска.
			ПорядокОплатыСтудент    = СтрокаПорядокОплаты.Студент;
			ПорядокОплатыКонтрагент = СтрокаПорядокОплаты.Контрагент;
			ПорядокОплатыДоговор    = СтрокаПорядокОплаты.Договор;
			
		КонецЦикла;
		ИтогиПорядокОплаты = СлужебнаяПорядокОплаты.Скопировать(,"Хеш,КоличествоВхождений");
		ИтогиПорядокОплаты.Свернуть("Хеш", "КоличествоВхождений");
		ИтогиПорядокОплаты.Сортировать("КоличествоВхождений Убыв");
		ОбщийПорядокОплаты = ?(ИтогиПорядокОплаты.Количество() = 0, Неопределено, ИтогиПорядокОплаты[0]);
		СлужебнаяПорядокОплаты.Колонки.Добавить("ОсобыйПорядокОплаты", Новый ОписаниеТипов("Булево"));
		Для Каждого СтрокаСлужебная Из СлужебнаяПорядокОплаты Цикл
			СтрокаСлужебная.ОсобыйПорядокОплаты = (СтрокаСлужебная.Хеш <> ОбщийПорядокОплаты.Хеш);
		КонецЦикла;
		
		// Заполним таб.часть "Порядок оплаты" и отдельные реквизиты таб.части "Доходы будущих периодов".
		ОбщийПорядокОплатыЗаполнен = Ложь;
		Для Каждого СтрокаДокумента Из ДокументОбъект.ДоходыБудущихПериодов Цикл
			
			Если ЗначениеЗаполнено(СтрокаДокумента.Студент)
				И ЗначениеЗаполнено(СтрокаДокумента.Контрагент)
				И ЗначениеЗаполнено(СтрокаДокумента.Договор) Тогда
				
				Отбор = Новый Структура("Студент,Контрагент,Договор");
				ЗаполнитьЗначенияСвойств(Отбор, СтрокаДокумента);
				
				// Определим, общий или особый порядок оплаты заполнять.
				НайденныеСтроки = СлужебнаяПорядокОплаты.НайтиСтроки(Отбор);
				СтрокаДокумента.ОсобыйПорядокОплаты = ?(НайденныеСтроки.Количество() = 0, Истина, НайденныеСтроки[0].ОсобыйПорядокОплаты);
				Если СтрокаДокумента.ОсобыйПорядокОплаты Тогда
					СтрокаДокумента.ИдентификаторСтроки = Новый УникальныйИдентификатор;
				Иначе
					СтрокаДокумента.ИдентификаторСтроки = Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000");
				КонецЕсли;
				
				// Заполним табличную часть "Порядок оплаты".
				СтрокиПорядокОплаты = ПорядокОплатыОбразование.НайтиСтроки(Отбор);
				Для Каждого СтрокаПорядокОплаты Из СтрокиПорядокОплаты Цикл
					
					Если СтрокаДокумента.ОсобыйПорядокОплаты ИЛИ НЕ ОбщийПорядокОплатыЗаполнен Тогда
						
						НоваяСтрока = ДокументОбъект.ПорядокОплаты.Добавить();
						НоваяСтрока.ИдентификаторСтроки = СтрокаДокумента.ИдентификаторСтроки;
						ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаПорядокОплаты,
							"ОплатитьДо,НачалоПериода,КонецПериода,Примечание,Валюта");
						
						НоваяСтрока.СуммаВВалютеДоИзменений    = СтрокаПорядокОплаты.СуммаВВалюте;
						НоваяСтрока.СуммаВВалюте               = 0;
						НоваяСтрока.СуммаВВалютеПослеИзменений = СтрокаПорядокОплаты.СуммаВВалюте;
						
					КонецЕсли;
					
				КонецЦикла;
				
				// Общий (стандартный) порядок оплаты заполняем только один раз.
				ОбщийПорядокОплатыЗаполнен = ОбщийПорядокОплатыЗаполнен ИЛИ НЕ СтрокаДокумента.ОсобыйПорядокОплаты;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если ЗначениеЗаполнено(ДокументОбъект.ПроцентИндексации) Тогда
			ИзменитьСуммыНаПроцент(ДокументОбъект);
		КонецЕсли;
		Если ЗначениеЗаполнено(ДокументОбъект.СуммаРаспределенная) Тогда
			РаспределитьСуммуПоПериодам(ДокументОбъект);
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗаполнитьПорядокУчетаДоходов Тогда
		
		ДокументОбъект.ПорядокУчетаДоходов.Очистить();
		
		ТаблицаОстатковДБП.Свернуть(
			"Организация,Контрагент,Договор,СпособПризнанияДоходов,ДатаНачалаСписания,ДатаОкончанияСписания,
			|СчетДоходов,СубконтоДоходов1,СубконтоДоходов2,СубконтоДоходов3,
			|ВидДеятельностиНУ,СчетДоходовНУ,СтатьяПрочихДоходовНУ", "ОстатокДБП");
		
		Для Каждого СтрокаТаблицы Из ТаблицаОстатковДБП Цикл
			
			НоваяСтрока = ДокументОбъект.ПорядокУчетаДоходов.Добавить();
			
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы,
				"ОстатокДБП,Контрагент,Договор,СпособПризнанияДоходов,ДатаНачалаСписания,ДатаОкончанияСписания,
				|СчетДоходов,СубконтоДоходов1,СубконтоДоходов2,СубконтоДоходов3,
				|ВидДеятельностиНУ,СчетДоходовНУ,СтатьяПрочихДоходовНУ");
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ИзменитьСуммыНаПроцент(ДокументОбъект) Экспорт
	
	ПустойИдентификатор = Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000");
	
	// Общий порядок оплаты.
	ИзменитьСуммыНаПроцентПоИдентификаторуСтроки(ДокументОбъект, ПустойИдентификатор);
	
	// Особый порядок оплаты.
	Для Каждого СтрокаТаблицы Из ДокументОбъект.ДоходыБудущихПериодов Цикл
		Если СтрокаТаблицы.ИдентификаторСтроки <> ПустойИдентификатор Тогда
			ИзменитьСуммыНаПроцентПоИдентификаторуСтроки(ДокументОбъект, СтрокаТаблицы.ИдентификаторСтроки);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ИзменитьСуммыНаПроцентПоИдентификаторуСтроки(ДокументОбъект, ИдентификаторСтроки)
	
	КоэффициентИндексации = Окр(ДокументОбъект.ПроцентИндексации / 100, 4);
	ОтборПоИдентификатору = Новый Структура("ИдентификаторСтроки", ИдентификаторСтроки);
	
	// Индексируем платежи по графику оплаты за периоды обучения, которые еще не завершились,
	// либо в соответствии с отбором по периоду обучения.
	СуммаКорректировкиДБП = 0;
	ГрафикОплаты = ДокументОбъект.ПорядокОплаты.НайтиСтроки(ОтборПоИдентификатору);
	Для Каждого СтрокаГрафика Из ГрафикОплаты Цикл
		
		ПараметрыПересчетаПериода = РаботаСоСтудентами.ПараметрыПересчетаПериодаОбучения(СтрокаГрафика, ДокументОбъект);
		
		СтрокаГрафика.СуммаВВалюте = // Сумма "до изменения", скорректированная на коэффициенты индексации и неполного периода.
			СтрокаГрафика.СуммаВВалютеДоИзменений * КоэффициентИндексации * ПараметрыПересчетаПериода.ДоляПериода;
			
		СтрокаГрафика.СуммаВВалютеПослеИзменений =
			СтрокаГрафика.СуммаВВалютеДоИзменений + СтрокаГрафика.СуммаВВалюте;
		
		// Увеличение (уменьшение) стоимости обучения непосредственно влияет на остатки ДБП по договору.
		СуммаКорректировкиДБП = СуммаКорректировкиДБП + СтрокаГрафика.СуммаВВалюте;
		
	КонецЦикла;
	
	// Остаток ДБП увеличиваем на сумму индексации.
	СтрокиДБП = ДокументОбъект.ДоходыБудущихПериодов.НайтиСтроки(ОтборПоИдентификатору);
	Для Каждого СтрокаДБП Из СтрокиДБП Цикл
		СтрокаДБП.Всего = СуммаКорректировкиДБП;
	КонецЦикла;
	
КонецПроцедуры

Процедура РаспределитьСуммуПоПериодам(ДокументОбъект) Экспорт
	
	ПустойИдентификатор = Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000");
	
	// Общий порядок оплаты.
	РаспределитьСуммуПоПериодамПоИдентификаторуСтроки(ДокументОбъект, ПустойИдентификатор);
	
	// Особый порядок оплаты.
	Для Каждого СтрокаТаблицы Из ДокументОбъект.ДоходыБудущихПериодов Цикл
		Если СтрокаТаблицы.ИдентификаторСтроки <> ПустойИдентификатор Тогда
			РаспределитьСуммуПоПериодамПоИдентификаторуСтроки(ДокументОбъект, СтрокаТаблицы.ИдентификаторСтроки);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура РаспределитьСуммуПоПериодамПоИдентификаторуСтроки(ДокументОбъект, ИдентификаторСтроки)
	
	ОтборПоИдентификатору = Новый Структура("ИдентификаторСтроки", ИдентификаторСтроки);
	
	// Опредеяем базу распределения по периодам обучения.
	ГрафикОплаты = ДокументОбъект.ПорядокОплаты.Выгрузить(ОтборПоИдентификатору,
		"НомерСтроки,НачалоПериода,КонецПериода,СуммаВВалютеДоИзменений,СуммаВВалюте");
	ГрафикОплаты.Колонки.Добавить("БазаРаспределения");
	Для Каждого СтрокаГрафика Из ГрафикОплаты Цикл
		
		ПараметрыПересчетаПериода = РаботаСоСтудентами.ПараметрыПересчетаПериодаОбучения(СтрокаГрафика, ДокументОбъект);
		
		СтрокаГрафика.БазаРаспределения = // Сумма "до изменения", скорректированная на коэффициент неполного периода.
			СтрокаГрафика.СуммаВВалютеДоИзменений * ПараметрыПересчетаПериода.ДоляПериода;
		
	КонецЦикла;
	
	// Распределяем сумму по периодам обучения.
	ОбщегоНазначенияБГУ.РаспределитьСуммуПоКолонкеТаблицы(ДокументОбъект.СуммаРаспределенная,
		ГрафикОплаты, "СуммаВВалюте", "БазаРаспределения");
	
	СтрокиПорядокОплаты = ДокументОбъект.ПорядокОплаты.НайтиСтроки(ОтборПоИдентификатору);
	Для Каждого СтрокаПорядокОплаты  Из СтрокиПорядокОплаты Цикл
		
		СтрокаГрафика = ГрафикОплаты.Найти(СтрокаПорядокОплаты.НомерСтроки, "НомерСтроки");
		СтрокаПорядокОплаты.СуммаВВалюте = ?(СтрокаГрафика <> Неопределено, СтрокаГрафика.СуммаВВалюте, 0);
		
		СтрокаПорядокОплаты.СуммаВВалютеПослеИзменений =
			СтрокаПорядокОплаты.СуммаВВалютеДоИзменений + СтрокаПорядокОплаты.СуммаВВалюте;
		
	КонецЦикла;
	
	// Остаток ДБП увеличиваем на сумму распределения.
	СтрокиДБП = ДокументОбъект.ДоходыБудущихПериодов.НайтиСтроки(ОтборПоИдентификатору);
	Для Каждого СтрокаДБП Из СтрокиДБП Цикл
		СтрокаДБП.Всего = ДокументОбъект.СуммаРаспределенная;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
